In [ ]:
import pandas as pd

# Importing Dataset
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Lets take the columns Survived and Sex
crosstab = pd.crosstab(df['Survived'], df['Sex'])
crosstab

Sex       female  male
Survived
0             81   468
1            233   109

In [9]:
from scipy.stats import chi2_contingency

res = chi2_contingency(crosstab)
pd.DataFrame(res.expected_freq, index = crosstab.index, columns=crosstab.columns)

Sex           female        male
Survived
0         193.474747  355.525253
1         120.525253  221.474747

*The chi-squared test shows that there is a significant difference between the expected and observed values. This means that the differences we see are not due to chance, but are instead real patterns in the data that can help us make predictions and this is the core idea behind the feature selection using this technique.*

In [10]:
res.pvalue

np.float64(1.1973570627755645e-58)

In [11]:
# Interpret the results
alpha = 0.05
if res.pvalue < alpha:
    print("\nWe reject the null hypothesis. There is a significant association between passenger class and survival rate.")
else:
    print("\nWe fail to reject the null hypothesis. There is no significant association between passenger class and survival rate.")

We reject the null hypothesis. There is a significant association between passenger class and survival rate.

*This indicates a strong correlation between the output and input feature*